// Задача 1
// Напиши дві функції:

// letMeSeeYourName(callback) - запитує імя користувача через prompt і повертає коллбек ф-цію callback
// greet(name) - колбек який приймає імя і логує в консоль строку "Привіт" + name

// Задача 2
// Напиши дві функції:

// makeProduct(name, price, callback) - приймає імя і ціну товару, а також колбек.
// Функція створює обєкт товару, добавляючи йому уникальний ідентификатор у властивості id
//  і викликає колбек передаючи йому створений обєкт.

// showProduct(product) - колбек приймаючий обєкт продукта і логіруючий його в консоль

// makeProduct("Холодильник", 10000, logger);
